<a href="https://colab.research.google.com/github/Renata-Thomazelli/mentoria2021/blob/main/wheat_production.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Analysing the wheat production

In [1]:
# Importing Drive
from google.colab import drive

drive.mount('/content/drive')

Mounted at /content/drive

In [102]:
#Importing 
import pandas as pd
import numpy as np
import chardet

## Reading CSV

In [103]:

file_path ='/content/drive/MyDrive/Data_Lake/'
file = 'paises_fechados.csv'

Reading encoding

In [104]:
with open(f"{file_path}{file}", 'rb') as encoding:
    r_encoding = chardet.detect(encoding.read(100000))
r_encoding

{'confidence': 1.0, 'encoding': 'ascii', 'language': ''}

Reading CSV

In [105]:
with open (f"{file_path}{file}",'r',encoding=r_encoding['encoding']) as countries:
  df_countries = pd.read_csv(countries)

# Dataframe

In [106]:
df_countries

       Country   Australia      Brazil  ... Philippines      Russia      Turkey
0    Commodity       Wheat       Wheat  ...       Wheat       Wheat       Wheat
1    Attribute  Production  Production  ...  Production  Production  Production
2    Frequency           A           A  ...           A           A           A
3   1960-01-01      7450.0       350.0  ...         0.0         NaN      7000.0
4   1961-01-01      6727.0       250.0  ...         0.0         NaN      6336.0
..         ...         ...         ...  ...         ...         ...         ...
60  2017-01-01     20941.0      4264.0  ...         0.0     85167.0     21000.0
61  2018-01-01     17598.0      5428.0  ...         0.0     71685.0     19000.0
62  2019-01-01     15200.0      5200.0  ...         0.0     73610.0     17500.0
63  2020-01-01     33000.0      6250.0  ...         0.0     85354.0     18250.0
64  2021-01-01     27000.0      6800.0  ...         0.0     85000.0     17250.0

[65 rows x 11 columns]

DEF TO RENAME NAMES

In [107]:
def replace (col): 
    return col.replace("-01-01",'')

In [108]:
df_countries.shape

(65, 11)

In [109]:
anos = {"Country":"Years"}
df_countries=\
(
    df_countries.drop(range(0,3))
    .rename(columns=anos)
    .set_index("Years")
    .rename(index=replace)
 )

In [110]:
df_countries.shape

(62, 10)

In [111]:
df_countries

      Australia  Brazil   Canada  ... Philippines   Russia   Turkey
Years                             ...
1960     7450.0   350.0  14108.0  ...         0.0      NaN   7000.0
1961     6727.0   250.0   7713.0  ...         0.0      NaN   6336.0
1962     8353.0   256.0  15392.0  ...         0.0      NaN   6804.0
1963     8925.0   100.0  19690.0  ...         0.0      NaN   7892.0
1964    10037.0   226.0  16349.0  ...         0.0      NaN   7000.0
...         ...     ...      ...  ...         ...      ...      ...
2017    20941.0  4264.0  30377.0  ...         0.0  85167.0  21000.0
2018    17598.0  5428.0  32352.0  ...         0.0  71685.0  19000.0
2019    15200.0  5200.0  32670.0  ...         0.0  73610.0  17500.0
2020    33000.0  6250.0  35183.0  ...         0.0  85354.0  18250.0
2021    27000.0  6800.0  32000.0  ...         0.0  85000.0  17250.0

[62 rows x 10 columns]

In [112]:
df_countries.isna().sum()

Australia       0
Brazil          0
Canada          0
China           0
Egypt           0
India           0
Indonesia       0
Philippines     0
Russia         27
Turkey          0
dtype: int64

In [113]:
#fillna and changing types
df_countries =\
(
    df_countries.fillna(0)
    .astype(float)
    .astype(int)
   
)

In [114]:
df_countries

       Australia  Brazil  Canada  ...  Philippines  Russia  Turkey
Years                             ...
1960        7450     350   14108  ...            0       0    7000
1961        6727     250    7713  ...            0       0    6336
1962        8353     256   15392  ...            0       0    6804
1963        8925     100   19690  ...            0       0    7892
1964       10037     226   16349  ...            0       0    7000
...          ...     ...     ...  ...          ...     ...     ...
2017       20941    4264   30377  ...            0   85167   21000
2018       17598    5428   32352  ...            0   71685   19000
2019       15200    5200   32670  ...            0   73610   17500
2020       33000    6250   35183  ...            0   85354   18250
2021       27000    6800   32000  ...            0   85000   17250

[62 rows x 10 columns]

In [115]:
#checking the usage
df_countries.info()

<class 'pandas.core.frame.DataFrame'>
Index: 62 entries, 1960 to 2021
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Australia    62 non-null     int64
 1   Brazil       62 non-null     int64
 2   Canada       62 non-null     int64
 3   China        62 non-null     int64
 4   Egypt        62 non-null     int64
 5   India        62 non-null     int64
 6   Indonesia    62 non-null     int64
 7   Philippines  62 non-null     int64
 8   Russia       62 non-null     int64
 9   Turkey       62 non-null     int64
dtypes: int64(10)
memory usage: 5.3+ KB

DADOS ESTATÍSTICOS

In [116]:
estatistica = \
(
    df_countries.describe(include=[np.number])
    .T
    .astype(int)
    .sort_values('max',ascending=False)

)
estatistica

             count   mean    std    min    25%    50%     75%     max
China           62  81563  38683  14250  42133  90548  112341  136000
India           62  53294  29405   9854  27019  54622   75046  108000
Russia          62  28359  27883      0      0  33085   47456   85354
Canada          62  23379   6491   7713  17833  24266   27241   37589
Australia       62  16519   6893   6590  10623  16143   21988   33000
Turkey          62  14017   3950   6336  11750  15375   16950   21000
Egypt           62   4506   2863   1272   1820   4193    7334    9000
Brazil          62   3195   2003    100   1894   2798    5275    6800
Indonesia       62      0      0      0      0      0       0       0
Philippines     62      0      0      0      0      0       0       0

In [117]:
df_countries.sort_index(ascending = False)

       Australia  Brazil  Canada  ...  Philippines  Russia  Turkey
Years                             ...
2021       27000    6800   32000  ...            0   85000   17250
2020       33000    6250   35183  ...            0   85354   18250
2019       15200    5200   32670  ...            0   73610   17500
2018       17598    5428   32352  ...            0   71685   19000
2017       20941    4264   30377  ...            0   85167   21000
...          ...     ...     ...  ...          ...     ...     ...
1964       10037     226   16349  ...            0       0    7000
1963        8925     100   19690  ...            0       0    7892
1962        8353     256   15392  ...            0       0    6804
1961        6727     250    7713  ...            0       0    6336
1960        7450     350   14108  ...            0       0    7000

[62 rows x 10 columns]

In [118]:
col = df_countries.columns
col

Index(['Australia', 'Brazil', 'Canada', 'China', 'Egypt', 'India', 'Indonesia',
       'Philippines', 'Russia', 'Turkey'],
      dtype='object')

In [119]:
df_countries.reset_index()

   Years  Australia  Brazil  Canada  ...  Indonesia  Philippines  Russia  Turkey
0   1960       7450     350   14108  ...          0            0       0    7000
1   1961       6727     250    7713  ...          0            0       0    6336
2   1962       8353     256   15392  ...          0            0       0    6804
3   1963       8925     100   19690  ...          0            0       0    7892
4   1964      10037     226   16349  ...          0            0       0    7000
..   ...        ...     ...     ...  ...        ...          ...     ...     ...
57  2017      20941    4264   30377  ...          0            0   85167   21000
58  2018      17598    5428   32352  ...          0            0   71685   19000
59  2019      15200    5200   32670  ...          0            0   73610   17500
60  2020      33000    6250   35183  ...          0            0   85354   18250
61  2021      27000    6800   32000  ...          0            0   85000   17250

[62 rows x 11 columns]

##The Top producer of each Year

In [120]:
tops_for_year=\
(
    df_countries.reset_index()
    .melt(id_vars = ["Years"],var_name="Countries",value_name = "Production")
    .sort_values("Production", ascending= False)
    .drop_duplicates(subset="Years")
)
tops_for_year

    Years Countries  Production
247  2021     China      136000
243  2017     China      134334
246  2020     China      134250
245  2019     China      133590
242  2016     China      133271
..    ...       ...         ...
186  1960     China       20960
190  1964     China       20840
127  1963    Canada       19690
188  1962     China       16665
187  1961     China       14250

[62 rows x 3 columns]

In [159]:
col_2= (df_countries.reset_index().eq(0).sum())
col_2

Years           0
Australia       0
Brazil          0
Canada          0
China           0
Egypt           0
India           0
Indonesia      62
Philippines    62
Russia         27
Turkey          0
dtype: int64

In [154]:
df_countries.astype(bool).sum(axis=0)

Australia      62
Brazil         62
Canada         62
China          62
Egypt          62
India          62
Indonesia       0
Philippines     0
Russia         35
Turkey         62
dtype: int64

In [160]:
lista =[]

for i,v in col_2.iteritems():
  if v ==0:
    lista.append(i)


print(lista)

['Years', 'Australia', 'Brazil', 'Canada', 'China', 'Egypt', 'India', 'Turkey']

## The last placed at each year

In [180]:
last_for_years=(
    df_countries.reset_index()
    .filter(items=lista)
    .melt(id_vars = ["Years"],var_name="Countries",value_name = "Production")
    .sort_values(["Years","Production"], ascending= [False,True])
    .drop_duplicates(subset="Years")
)
last_for_years

    Years Countries  Production
123  2021    Brazil        6800
122  2020    Brazil        6250
121  2019    Brazil        5200
120  2018    Brazil        5428
119  2017    Brazil        4264
..    ...       ...         ...
66   1964    Brazil         226
65   1963    Brazil         100
64   1962    Brazil         256
63   1961    Brazil         250
62   1960    Brazil         350

[62 rows x 3 columns]

In [174]:
type(last_for_years)

pandas.core.frame.DataFrame

In [176]:
last_for_years.Production.max()

136000